src/test/resources/Add.XML

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
    <soap:Body>
        <Add xmlns="http://tempuri.org/">
            <intA>10</intA>
            <intB>20</intB>
        </Add>
    </soap:Body>
</soap:Envelope>